snlkuharlocal/src/Documents/ЛистПереукладки/ЛистПереукладки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистПереукладки</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКороба</name>
    <type>
      <types>CatalogRef.ТипыКоробов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКСкотча1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШКСкотча2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуффиксЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШККонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтикеткаРаспечатана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПриОпределенииКоличестваМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегации</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегацииОтсканирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сканировщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСканирования</name>
    <type>
      <types>EnumRef.РежимСканирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеТребуетсяСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаАгрегацию</name>
    <type>
      <types>DocumentRef.ЗаданиеНаАгрегацию</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.СкладТСД</types>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СканировщикФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтклКонтрольНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КолШтВКоробке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛСК</name>
    <type>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипШК</name>
      <type>
        <types>EnumRef.ТипыШтрихКодов</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтВКоробе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСпайка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодБлочка</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ОшибкаСканирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОшибкиСотрудников</name>
    <attributes>
      <name>ВидОшибки</name>
      <type>
        <types>EnumRef.ВидыОшибокСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробокДляАгрегации</name>
    <attributes>
      <name>ИсходныйКодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйКодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СодержимоеБлочка</name>
    <comment>По ЗНА</comment>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БлочкиВсего</name>
    <comment>По ЗНА</comment>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковокБлочков</name>
    <comment>заранее забронированные по ЗНА</comment>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бригада</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ИспользованныеКодыАгрегаций/ИспользованныеКодыАгрегаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользованныеКодыАгрегаций</name>
  <comment>Использованные коды агрегаций</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ВидыОперацийМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийМаркировки</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>БронированиеАгрегационныхКодов</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки</name>
    <comment>Трансформация упаковки (Добавление, Изъятие)</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК</name>
    <comment>Трансформация АТК (Добавление, Изъятие)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЛистПереукладки/ManagerModule.bsl
Функция ПолучитьМаксимальныйНомерКоробкиПоНакладной (Накладная) экспорт
	
	Запрос= новый запрос;   
	Запрос.УстановитьПараметр("Накладная",Накладная);
	Запрос.Текст="ВЫБРАТЬ
	|	ЛистПереукладки.НомерКоробки КАК НомерКоробки
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.ДокОснование = &Накладная
	|	И ЛистПереукладки.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерКоробки УБЫВ"; 
	
	МаксимальныйНомер = 0;
	Выборка = запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		возврат Выборка.НомерКоробки;
	КонецЦикла;
	
	возврат МаксимальныйНомер;
	
КонецФункции    


Функция ПереномероватьВсеКоробкиНакладной (Накладная) экспорт
	Запрос= новый запрос;   
	Запрос.УстановитьПараметр("Накладная",Накладная);
	Запрос.Текст="ВЫБРАТЬ
	|	ЛистПереукладки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.ДокОснование = &Накладная
	|	И ЛистПереукладки.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер";
	Выборка = запрос.Выполнить().Выбрать();
	Сч=1;
	пока Выборка.Следующий() цикл
		ЛПОбъект = Выборка.ссылка.получитьОбъект();
		ЛПОбъект.НомерКоробки = сч;
		ЛПОбъект.ПростоЗаписать();   
		сч = сч+1;	
	КонецЦикла;
	
КонецФункции               


Процедура ВернутьЛистОтЗНАВРаботу(Лист) экспорт
	
	ЛистОбъект = Лист.ПолучитьОбъект();
	ЛистОбъект.СканировщикФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	ЛистОбъект.Бригада.Очистить(); // Кельманов А.В. - SNL-187 + SNL-208 - 2026.04.22
	ЛистОбъект.УзелТСД = Неопределено;
	ЛистОбъект.РабочееМесто = Неопределено;
	ЛистОбъект.ОтправленНаТСД = ложь;
	ЛистОбъект.ЗагруженИзТСД = ложь;
	ЛистОбъект.ШтрихкодыУпаковок.Очистить();     
	ЛистОбъект.ДатаНачалаСканирования = ПустаяДата();
	ЛистОбъект.ДатаОкончанияСканирования = ПустаяДата();	
	для каждого СтрТЧ из ЛистОбъект.Товары цикл
		СтрТЧ.Отсканировано = 0;
	КонецЦикла;
	ЛистОбъект.ПростоЗаписать();
	
КонецПроцедуры
//////////////////////////////////////////////////////////////////////////////////////////////
// Шворобей ВЮ 23.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5156
//////////////////////////////////////////////////////////////////////////////////////////////

Функция НайтиКоличествоВТабличныхЧастяхДокумента(Знач ТЗ_Товары, Знач ТЗ_ШтрихКодыУпаковок, Знач Номенклатура) Экспорт
	
	СтруктураВозврата = Новый Структура("Номенклатура, КоличествоТовары, КоличествоШтрихКоды", Номенклатура, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ_Товары", ТЗ_Товары);
	Запрос.УстановитьПараметр("ТЗ_ШтрихКодыУпаковок", ТЗ_ШтрихКодыУпаковок);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗ_Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ТЗ_Товары.Количество, 0) КАК КоличествоТовары
	|ПОМЕСТИТЬ вр_Товары
	|ИЗ
	|	&ТЗ_Товары КАК ТЗ_Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗ_ШтрихКодыУпаковок.ШтрихкодУпаковки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК ШтрихкодУпаковки,
	|	ЕСТЬNULL(ТЗ_ШтрихКодыУпаковок.Количество, 0) КАК КоличествоШтрихКоды
	|ПОМЕСТИТЬ вр_Штрихкоды
	|ИЗ
	|	&ТЗ_ШтрихКодыУпаковок КАК ТЗ_ШтрихКодыУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Товары.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(вр_Товары.КоличествоТовары, 0)) КАК КоличествоТовары,
	|	СУММА(ЕСТЬNULL(вр_Штрихкоды.КоличествоШтрихКоды, 0)) КАК КоличествоШтрихКоды
	|ИЗ
	|	вр_Товары КАК вр_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Штрихкоды КАК вр_Штрихкоды
	|		ПО вр_Товары.Номенклатура = вр_Штрихкоды.ШтрихкодУпаковки.Владелец
	|ГДЕ
	|	вр_Товары.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_Товары.Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);	
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ТекстЗапроса_ВсеКодыДокумента()
	Возврат "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки,ШтрихкодБлочка,Ссылка.КодАгрегации КАК ШтрихкодКоробки
	|ПОМЕСТИТЬ ВТ_ШтрихкодыУпаковок
	|ИЗ
	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТ_ВсеКМДокумента
	|ИЗ
	|	ВТ_ШтрихкодыУпаковок
	|ГДЕ	
	|	ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ШтрихкодБлочка
	|ИЗ
	|	ВТ_ШтрихкодыУпаковок
	|ГДЕ	
	|	ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ШтрихкодКоробки
	|ИЗ
	|	ВТ_ШтрихкодыУпаковок
	|ГДЕ	
	|	ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|";
КонецФункции

Функция ПолучитьПорцииКМДляПроверки(ДокСсылка, РазмерПорции = 1000) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ВсеКодыДокумента() + "
	|;
	|ВЫБРАТЬ
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки.Наименование КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ВсеКМДокумента
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ИспользованныеКодыАгрегаций КАК ИспользованныеКА
	|ПО 	
	|	ИспользованныеКА.ШтрихКодУпаковки = ВТ_ВсеКМДокумента.ШтрихКодУпаковки
	|	И ИспользованныеКА.Регистратор ССЫЛКА Документ.МаркировкаТоваровИСМП
	|	И ИспользованныеКА.Регистратор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан)
	|	И ИспользованныеКА.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
	|	И ИспользованныеКА.Регистратор.ДокументОснование ССЫЛКА Документ.РасходнаяНакладная
	|ГДЕ
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки.Наименование КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ВсеКМДокумента
	|ГДЕ 
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки.ТипКода <> ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоСтрок 	= Выборка.Количество();
	Сч			= 0;
	
	Порции = Новый Массив;
	ТекПорция = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Сч = Сч + 1;
		
		ТекПорция.Добавить(Выборка.ШтрихкодУпаковки);
		Если ТекПорция.Количество() >= РазмерПорции ИЛИ Сч >= ВсегоСтрок Тогда
			Порции.Добавить(ТекПорция);
			ТекПорция = Новый Массив;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Порции;
КонецФункции //ПолучитьКМДляПроверки(ДокСсылка) Экспорт

Функция ПолучитьТаблицуКМДокумента(ДокСсылка, ДопПараметры = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ВсеКодыДокумента() + "
	|;
	|ВЫБРАТЬ
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ВсеКМДокумента
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ИспользованныеКодыАгрегаций КАК ИспользованныеКА
	|ПО 	
	|	ИспользованныеКА.ШтрихКодУпаковки = ВТ_ВсеКМДокумента.ШтрихКодУпаковки
	|	И ИспользованныеКА.Регистратор ССЫЛКА Документ.МаркировкаТоваровИСМП
	|	И ИспользованныеКА.Регистратор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан)
	|	И ИспользованныеКА.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
	|	И ИспользованныеКА.Регистратор.ДокументОснование ССЫЛКА Документ.РасходнаяНакладная
	|ГДЕ
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ВсеКМДокумента
	|ГДЕ 
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки.ТипКода <> ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|";                                                                                
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьТаблицуКМДокумента(ДокСсылка, ДопПараметры = Неопределено) Экспорт
//++Данилова Е.В. 27.02.2026 SNL-150 
Процедура ОбработатьПланНабора (ВидДокументаОснования,ДокОснование) Экспорт
	
	Если СтрНайти("Перемещение,РасходнаяНакладная,Комплектация",ВидДокументаОснования)<>0 Тогда
		// Кухарь А.Ю.  17.08.2022 начало
		//ПланНабора			= Документы.ПланНабора.НайтиПоРеквизиту("ДокОснование",ДокОснование);
		ПланНабора=НайтиДокумент("ПланНабора",Новый Структура("ДокОснование,Проведен",ДокОснование,Истина));	 
		// Кухарь А.Ю.  17.08.2022 конец 
		
		ЗаданияНабора = ЗаданиянабораПоНакладной(ДокОснование); 		
		
		ОтсканировалиНеТотЗНБ = Ложь;
		//ЗНБсОшибками = ПроверитьОшибкиПоЗНБ(ДокОснование,ЗаданияНабора,ОтсканировалиНеТотЗНБ);	 			
		ВремяОкончания 		= ТекущаяДата();
		ПланНабораОбъект 	= ПланНабора.ПолучитьОбъект();
		
		для каждого СтрЗНБ из ЗаданияНабора цикл
			ЗНБ=СтрЗНБ.ЗаданиеНабора;		
			Если ОтсканировалиНеТотЗНБ=Истина Тогда
				Отказ 		= Истина;				
				#Если Клиент Тогда
					Сообщить("Не совпадает номенклатура в планах набора и листе набора! Пересканируйте планы набора!");						
				#КонецЕсли	
				Отказ = Истина;	
			КонецЕсли;		
			СтароеСостояние=ЗНБ.СостояниеНакладной;
			если СтароеСостояние=Перечисления.СостоянияНакладной.ОжиданиеНабора или СтароеСостояние=Перечисления.СостоянияНакладной.ВНаборе тогда
				#Если Клиент Тогда
					Сообщить("Не закончен набор! Завершение сканирования невозможно!");	
				#КонецЕсли
				Продолжить;
			КонецЕсли;		
			
			// Кухарь А.Ю.  11.11.2024 начало
			если ПолучитьНомерСостоянияНакладной(СтароеСостояние)>1180 тогда
				Продолжить;
			КонецЕсли;	
			// Кухарь А.Ю.  11.11.2024 конец
			
			
			//СтрТЗ=ЗНБсОшибками.найти(ЗНБ);	
			//если СтрТЗ=Неопределено тогда
			//НовоеСостояние=ПолучитьНовоеСостояниеЗНБ (ЗНБ,Перечисления.СостоянияНакладной.Сканирование);
			
			НовоеСостояние = ПолучитьНовоеСостояниеЗНБЛП(знб, СтароеСостояние);

			НужноЗаканчиватьСканирование=Истина;	
			//иначе
			//	НовоеСостояние=Перечисления.СостоянияНакладной.Сканирование;
			//	НужноЗаканчиватьСканирование=ложь;
			//КонецЕсли;		
			
			если НовоеСостояние<>СтароеСостояние тогда			
				МассСтрок=ПланНабораОбъект.тБрэндов.найтистроки(новый Структура("НомерЧасти",ЗНБ.НомерЧасти));
				для каждого СтрокаПН из МассСтрок цикл
					СтрокаПН.Состояние 				= НовоеСостояние;
					если НужноЗаканчиватьСканирование=Истина тогда
						СтрокаПН.ОкончаниеСканировки	= ВремяОкончания;
						СтрокаПН.СканировкаЗакончена	= Истина;
						СтрокаПН.ВремяТекущегоСостояния = ВремяОкончания;
						если СтрокаПН.НачалоСканировки=ПустаяДата() тогда
							СтрокаПН.НачалоСканировки=ВремяОкончания-1;
						КонецЕсли;
					КонецЕсли;					
				КонецЦикла;		 
			КонецЕсли;
		КонецЦикла;
		
		если ПланНабораОбъект.Модифицированность() тогда
			ПланНабораОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;			
КонецПроцедуры

Функция ПолучитьНовоеСостояниеЗНБЛП(Знач знб, Знач СтароеСостояние)  
		
	СтрокаВЗНБОжПаллетирования=знб.ПланируемыеСостояния.Найти(Перечисления.СостоянияНакладной.ОжиданиеПаллетирования);
	Если СтрокаВЗНБОжПаллетирования <> Неопределено
		И НЕ СтрокаВЗНБОжПаллетирования.Пропустить Тогда
		
		НовоеСостояние = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования; 	
	Иначе
		НовоеСостояние = Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
		//СтрокаПлСост =знб.ПланируемыеСостояния.Найти(Перечисления.СостоянияНакладной.ОжиданиеПаллетирования);
		//Если СтрокаПлСост = неопределено Тогда
		//	
		//	НовоеСостояние = СтароеСостояние; 	
		//Иначе
		//	ОжидаемоеНовоеСостояние = Неопределено; 
		//	если ЗНБ.ПланируемыеСостояния.Индекс(СтрокаПлСост)+1 = ЗНБ.ПланируемыеСостояния.количество() тогда
		//		НовоеСостояние = СтароеСостояние;
		//	Иначе
		//		Сч = 0; 
		//		Пока сч<ЗНБ.ПланируемыеСостояния.Количество() цикл 
		//			сч=сч+1;
		//			НоваяСтрока=ЗНБ.ПланируемыеСостояния.Получить(ЗНБ.ПланируемыеСостояния.Индекс(СтрокаПлСост)+1);
		//			если НоваяСтрока.Пропустить тогда
		//				СтрокаПлСост=НоваяСтрока;
		//			иначе
		//				ОжидаемоеНовоеСостояние=НоваяСтрока.Состояние;
		//				Прервать;
		//			КонецЕсли;
		//		КонецЦикла;
		//		Если ЗначениеЗаполнено(ОжидаемоеНовоеСостояние) Тогда
		//			
		//			НовоеСостояние = ОжидаемоеНовоеСостояние;	
		//			
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	Возврат НовоеСостояние;

КонецФункции

Функция ПроверитьОшибкиПоЗНБ(ДокОснование,ЗаданияНабора,ОтсканировалиНеТотЗНБ)
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	             |	ЗНБ.Номенклатура КАК Номенклатура,
	             |	СУММА(ЕСТЬNULL(ЗНБ.Количество, 0)) КАК Количество,
	             |	ЗНБ.Ссылка.Накладная КАК Накладная,
	             |	ЗНБ.Ссылка КАК Ссылка
	             |ПОМЕСТИТЬ тЗНБ
	             |ИЗ
	             |	Документ.ЗаданиеНабора.Товары КАК ЗНБ
	             |ГДЕ
	             |	ЗНБ.Ссылка.Ссылка В(&СписокЗНБ)
	             |	И ЗНБ.Ссылка.Дата >= &Дата
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ЗНБ.Номенклатура,
	             |	ЗНБ.Ссылка.Накладная,
	             |	ЗНБ.Ссылка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЛистНабораТовары.Номенклатура КАК Номенклатура,
	             |	СУММА(ЛистНабораТовары.Отсканировано) КАК Количество
	             |ПОМЕСТИТЬ тЛН
	             |ИЗ
	             |	Документ.ЛистПереукладки КАК ЛистПереукладки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.Товары КАК ЛистНабораТовары
	             |		ПО (ЛистНабораТовары.Ссылка = ЛистПереукладки.Ссылка)
	             |ГДЕ
	             |	ЛистПереукладки.Дата >= &Дата
	             |	И ЛистПереукладки.Проведен
	             |	И ЛистПереукладки.ЛистНабора.ДокОснование = &Накладная
	             |	И НЕ ЛистПереукладки.ЛистНабора.ТребуетПроверки
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ЛистНабораТовары.Номенклатура
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	тЗНБ.Номенклатура КАК Номенклатура,
	             |	СУММА(ЕСТЬNULL(тЗНБ.Количество, 0)) КАК План,
	             |	СУММА(ЕСТЬNULL(тЛН.Количество, 0)) КАК Факт,
	             |	тЗНБ.Ссылка КАК ЗНБ
	             |ИЗ
	             |	тЗНБ КАК тЗНБ
	             |		ПОЛНОЕ СОЕДИНЕНИЕ тЛН КАК тЛН
	             |		ПО тЗНБ.Номенклатура = тЛН.Номенклатура
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	тЗНБ.Номенклатура,
	             |	тЗНБ.Ссылка
	             |
	             |ИМЕЮЩИЕ
	             |	СУММА(ЕСТЬNULL(тЗНБ.Количество, 0)) <> СУММА(ЕСТЬNULL(тЛН.Количество, 0))";
	запрос.УстановитьПараметр("Дата",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()-30*24*3600);
	запрос.УстановитьПараметр("СписокЗНБ",ЗаданияНабора.ВыгрузитьКолонку("ЗаданиеНабора"));
	запрос.УстановитьПараметр("Накладная",ДокОснование);
	ТЗОшибок=запрос.Выполнить().Выгрузить();
	если ТЗОшибок.НайтиСтроки(новый Структура("План",0)).Количество()>0 тогда
		ОтсканировалиНеТотЗНБ=Истина;
	иначе
		ОтсканировалиНеТотЗНБ=ложь;		
	КонецЕсли;
	ТЗОшибок.Свернуть("ЗНБ");
	возврат ТЗОшибок;
КонецФункции

Функция ЗаданиянабораПоНакладной(Накладная,ТолькоРезультат = Ложь) экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНабора.Ссылка КАК ЗаданиеНабора
	|ИЗ
	|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|ГДЕ
	|	ЗаданиеНабора.Накладная = &Накладная
	|	И ЗаданиеНабора.Проведен";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если ТолькоРезультат Тогда 
		Возврат НЕ РезультатЗапроса.Пустой();
	Иначе 
		Возврат РезультатЗапроса.Выгрузить(); 
	КонецЕсли;
КонецФункции

//--Данилова Е.В. 27.02.2026 

//++Данилова Е.В. 02.03.2026 SNL-153
Функция НайтиСоздатьТипКороба(Данные)  Экспорт
	Результат=Справочники.ТипыКоробов.НайтиПоРеквизиту("ШтрихКод",Данные);
	Если НЕ Результат.Пустая() Тогда
		Возврат Результат;	
	КонецЕсли; 
	
	КоробкаНоменклатуры = НайтиТоварПоШтрихКоду(Данные,Перечисления.ТипыШтрихКодов.Коробка); 
	Если КоробкаНоменклатуры.Пустая() Тогда
		КоробкаНоменклатуры = НайтиТоварПоШтрихКоду(Данные,Перечисления.ТипыШтрихКодов.Блочок);
		Если КоробкаНоменклатуры.Пустая() Тогда
			Сообщить("Неверный ШК короба/блочка: "+Данные,СтатусСообщения.Важное); 
		Иначе
			НовыйТипКороба						= Справочники.ТипыКоробов.СоздатьЭлемент();
			
			НовыйТипКороба.Родитель 			= Справочники.ТипыКоробов.СтандартныеКороба;
			НовыйТипКороба.КоличествоВКоробе	= КоробкаНоменклатуры.Родитель.ШтукВКоробочке;
			
			Если КоробкаНоменклатуры.Родитель.ШтукВКоробочке > 0 Тогда
				НовыйТипКороба.Объем = КоробкаНоменклатуры.Родитель.ОбъемКоробки*КоробкаНоменклатуры.Родитель.ШтукВКоробочке/КоробкаНоменклатуры.Родитель.ШтукВКоробке;
			Иначе
				НовыйТипКороба.Объем = 0;
			КонецЕсли;
			НовыйТипКороба.Наименование = КоробкаНоменклатуры.Наименование+ " Объем: "+НовыйТипКороба.Объем;
			
			НовыйТипКороба.ШтрихКод = Данные;
			
			НовыйТипКороба.Записать();
			
			Результат = НовыйТипКороба.Ссылка;
		КонецЕсли;                          
	Иначе
		НовыйТипКороба 						= Справочники.ТипыКоробов.СоздатьЭлемент();
		
		НовыйТипКороба.Родитель 			= Справочники.ТипыКоробов.СтандартныеКороба;
		НовыйТипКороба.КоличествоВКоробе	= КоробкаНоменклатуры.Родитель.ШтукВКоробке;				
		НовыйТипКороба.Объем 				= КоробкаНоменклатуры.Родитель.ОбъемКоробки;
		НовыйТипКороба.Наименование 		= КоробкаНоменклатуры.Наименование+ " Объем: "+НовыйТипКороба.Объем;
		НовыйТипКороба.ШтрихКод				= Данные;
		
		НовыйТипКороба.Записать();
		
		Результат = НовыйТипКороба.Ссылка;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции
 //--Данилова Е.В. 02.03.2026
 #Область РаботаПоЗНАЛистов  
 //++Данилова Е.В. 27.04.2026 SNL-202 
 Функция ЗапрещеноСоздаватьЛисты(Знач РНК) Экспорт
 
 	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛистПереукладки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистПереукладки КАК ЛистПереукладки
		|ГДЕ
		|	ЛистПереукладки.ДокОснование = &ДокОснование
		|	И ЛистПереукладки.Проведен
		//|	И ЛистПереукладки.ЗаданиеНаАгрегацию <> ЗНАЧЕНИЕ(Документ.ЗаданиеНаАгрегацию.ПустаяСсылка)
		|	И НЕ ЛистПереукладки.ОтклКонтрольНоменклатуры";
	
	Запрос.УстановитьПараметр("ДокОснование", РНК);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой(); 

 
КонецФункции // РазрешеноСоздаватьЛисты()

Функция НайтиЕдиныйЗНАПоРНК(Знач РНК) Экспорт 
	
	СтруктураВозврата 	 = новый Структура("Успех,Ошибки,Данные",Ложь,новый Массив,Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаданиеНаАгрегацию.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНаАгрегацию КАК ЗаданиеНаАгрегацию
	|ГДЕ
	|	ЗаданиеНаАгрегацию.Проведен
	|	И ЗаданиеНаАгрегацию.ДокОснование = &ДокОснование
	|	И ЗаданиеНаАгрегацию.ПроизвольнаяКоробка";
	
	Запрос.УстановитьПараметр("ДокОснование", РНК.ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		СтруктураВозврата.Успех = Истина; 
		СтруктураВозврата.Данные = ВыборкаДетальныеЗаписи.ссылка; 
		
		Возврат СтруктураВозврата; 
		
	Иначе
		СтруктураЗаполненияШапкиЗНА = новый Структура("ТипКороба,Товары,КоличествоКоробок,НеПроверятьКороб",Справочники.ТипыКоробов.ПустаяСсылка(),РНК.Товары.Выгрузить(),0,истина);
		
		РезультатПолучения = Документы.ЗаданиеНаАгрегацию.НайтиСоздатьЗНАПоНакладнойИСтруктуреПараметров(РНК.Ссылка,СтруктураЗаполненияШапкиЗНА);
		Если РезультатПолучения.Успех Тогда 
			
			Если РНК.СостояниеНакладной <> Перечисления.СостоянияНакладной.Переукладка Тогда
				РНКОбъект = РНК.ПолучитьОбъект();
				
				РНКОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.Переукладка;
				
				РНКОбъект.Записать();
			КонецЕсли;
			
		КонецЕсли;		
		Возврат РезультатПолучения; 
	КонецЕсли;
КонецФункции 

Процедура ПроставитьКоличествоКоробокПоЗНА(Знач РНК) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаАгрегацию.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНаАгрегацию КАК ЗаданиеНаАгрегацию
	|ГДЕ
	|	ЗаданиеНаАгрегацию.Проведен
	|	И ЗаданиеНаАгрегацию.ДокОснование = &ДокОснование
	|	И ЗаданиеНаАгрегацию.ПроизвольнаяКоробка";
	
	Запрос.УстановитьПараметр("ДокОснование", РНК.ссылка);
	ЗНАТЧ = Запрос.Выполнить().Выгрузить();
	
	Если ЗНАТЧ.Количество() = 1 Тогда  		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладки.Ссылка) КАК Количество
		|ИЗ
		|	Документ.ЛистПереукладки КАК ЛистПереукладки
		|ГДЕ
		|	ЛистПереукладки.Проведен
		|	И ЛистПереукладки.ЗаданиеНаАгрегацию = &ЗаданиеНаАгрегацию";
		
		Запрос.УстановитьПараметр("ЗаданиеНаАгрегацию", ЗНАТЧ[0].ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		Если Выборка.Следующий() Тогда
		
			ЗнаОбъект = ЗНАТЧ[0].ссылка.ПолучитьОбъект(); 	
		    ЗнаОбъект.КоличествоКоробок = Выборка.Количество;
			ЗнаОбъект.Записать(); 
			
		КонецЕсли; 		
	 	
	КонецЕсли;

КонецПроцедуры

//--Данилова Е.В. 27.04.2026 
 	
 #КонецОбласти
